# Rebar Get Hook Type Id Method

Source: https://www.revitapidocs.com/2026/016d53d9-0ef5-99d1-b12f-089f04df3952.htm

---

| Rebar Get Hook Type Id Method |
| --- |

Get the id of the RebarHookType that is applied to the rebar.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ElementId GetHookTypeId(
	int end
)
```

```
Public Function GetHookTypeId (
	end As Integer
) As ElementId
```

```
public:
ElementId^ GetHookTypeId(
	int end
)
```

```
member GetHookTypeId :
        end : int -> ElementId
```

#### Parameters

end Int32
:   0 for the start hook, 1 for the end hook.

#### Return Value

ElementId
The id of a RebarHookType, or invalidElementId if the rebar has
 no hook at the specified end. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | end must be 0 or 1\. |

See Also

#### Reference

Rebar Class Autodesk.Revit.DB.Structure Namespace